In [5]:
%load_ext sql
%sql mysql+mysqlconnector://root:Sri12345@localhost:3060/bda

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql
-- Recyclable and Low Fat Products

CREATE TABLE products (
    product_id INT PRIMARY KEY,
    low_fats ENUM('Y', 'N'),
    recyclable ENUM('Y', 'N')
);

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO products (product_id, low_fats, recyclable) 
VALUES 
(0, 'Y', 'N'),
(1, 'Y', 'Y'),
(2, 'N', 'Y'),
(3, 'Y', 'Y'),
(4, 'N', 'N');

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
5 rows affected.

[]

In [9]:
%%sql 
select * from Products

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
5 rows affected.

[(0, 'Y', 'N'), (1, 'Y', 'Y'), (2, 'N', 'Y'), (3, 'Y', 'Y'), (4, 'N', 'N')]

In [8]:
%%sql
select product_id from products where low_fats='Y' and  recyclable='Y'

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
2 rows affected.

[(1,), (3,)]

In [10]:
%%sql
create table Customer(
    id int primary key,
    name varchar(100),
    referee_id int 
);

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
0 rows affected.

[]

In [11]:
%%sql
insert into Customer (id,name,referee_id) 
values
(1,'Will',NULL),
(2,'Jane',NULL),
(3,'Alex',2),
(4,'Bill',NULL),
(5,'Zack',1),
(6,'Mark',2);

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
6 rows affected.

[]

In [12]:
%%sql
select * from Customer

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
6 rows affected.

[(1, 'Will', None),
 (2, 'Jane', None),
 (3, 'Alex', 2),
 (4, 'Bill', None),
 (5, 'Zack', 1),
 (6, 'Mark', 2)]

In [14]:
%%sql
select name from Customer where referee_id !=2 or referee_id is null

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
4 rows affected.

[('Will',), ('Jane',), ('Bill',), ('Zack',)]

In [15]:
%%sql
create table World(
    name varchar(255) Primary key,
    continent varchar(255),
    area int,
    population int,
    gdp bigint
    );

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
0 rows affected.

[]

In [17]:
%%sql
insert into World(name,continent,area,population,gdp)
values
('Afghanistan','Asia',652230,25500100,20343000000),
('Albania','Europe',28748,2831741,12960000000),
('Algeria','Africa',2381741,37100000,188681000000),
('Andorra','Europe',468,78115,3712000000),
('Angola','Africa',1246700,20609294,100990000000 );

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
5 rows affected.

[]

In [18]:
%%sql
select * from World

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
5 rows affected.

[('Afghanistan', 'Asia', 652230, 25500100, 20343000000),
 ('Albania', 'Europe', 28748, 2831741, 12960000000),
 ('Algeria', 'Africa', 2381741, 37100000, 188681000000),
 ('Andorra', 'Europe', 468, 78115, 3712000000),
 ('Angola', 'Africa', 1246700, 20609294, 100990000000)]

In [19]:
%%sql
select name,population,area
from World 
where 
population >=25000000 or area >=3000000

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
2 rows affected.

[('Afghanistan', 25500100, 652230), ('Algeria', 37100000, 2381741)]

In [20]:
%%sql
create table Views(
    article_id int,
    author_id int,
    viewer_id int,
    view_date date 
);

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
0 rows affected.

[]

In [21]:
%%sql
insert into Views (article_id,author_id,viewer_id,view_date)
values
(1,3,5,'2019-08-01'),
(1,3,6,'2019-08-02'),
(2, 7,7,'2019-08-01'),
(2,7,6,'2019-08-02'),
(4,7,1,'2019-07-22'),
(3, 4,4,'2019-07-21'),
(3,4,4,'2019-07-21');

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
7 rows affected.

[]

In [22]:
%%sql
select * from Views

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
7 rows affected.

[(1, 3, 5, datetime.date(2019, 8, 1)),
 (1, 3, 6, datetime.date(2019, 8, 2)),
 (2, 7, 7, datetime.date(2019, 8, 1)),
 (2, 7, 6, datetime.date(2019, 8, 2)),
 (4, 7, 1, datetime.date(2019, 7, 22)),
 (3, 4, 4, datetime.date(2019, 7, 21)),
 (3, 4, 4, datetime.date(2019, 7, 21))]

In [23]:
%%sql
select distinct author_id as id from Views where author_id = viewer_id
order by author_id asc;

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
2 rows affected.

[(4,), (7,)]

In [24]:
%%sql 
create table Tweets(
    tweet_id int primary key,
    content varchar(255)
);

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
0 rows affected.

[]

In [25]:
%%sql
insert into Tweets(tweet_id,content)
values
(1,'Let us Code'),
(2,'More than fifteen chars are here!');

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
2 rows affected.

[]

In [26]:
%%sql
select tweet_id from Tweets where length(content)> 15

 * mysql+mysqlconnector://root:***@localhost:3060/bda
   mysql+mysqlconnector://root:***@localhost:3060/sri
1 rows affected.

[(2,)]